# Задача 4: Линейный поиск

## Описание

В данной задаче реализуется алгоритм линейного поиска для нахождения всех вхождений заданного элемента в массив. Линейный поиск проходит по каждому элементу массива и проверяет, совпадает ли он с искомым значением. Если элемент найден, возвращаются индексы его вхождений; если не найден — возвращается -1.

### Формат входных данных
- Входные данные находятся в файле input.txt.
- Первая строка содержит массив целых чисел.
- Вторая строка содержит целое число v, которое нужно найти в массиве.

### Формат выходных данных
- В выходном файле output.txt должен содержаться список индексов всех вхождений элемента v, разделённых запятой и пробелом. Если элемент не найден, выводится -1.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта
```
lab1/
|-- task4/
|   |-- input.txt               # Входные данные
|   |-- sort4.py                # Реализация алгоритма линейного поиска
|   |-- output.txt              # Выходные данные
|   |-- test_linear_search.py   # Тесты для проверки корректности работы алгоритма
```
## Код задачи
```
def l_search(arr, v):
    result = list()
    for i, num in enumerate(arr):
        if num == v:
            result.append(str(i))
    return result if result else '-1'

if __name__ == '__main__':
    with open('input.txt') as f:
        array, v = f.readlines()
    result = l_search(array.split(), v)
    result = ', '.join(result) if isinstance(result, list) else '-1'
    with open('output.txt', 'w') as f:
        print(result, file=f)
```
## Запуск проекта

1. Перейдите в директорию task4.
2. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
3. Запустите скрипт:
      python sort4.py
   
4. Результат выполнения будет записан в файл output.txt.

## Тестирование

Для проверки корректности работы программы выполните тесты, находящиеся в директории task4.

1. Выполните команду:
      python -m unittest test_linear_search.py
   

### Тесты
```
import unittest
import sys
import os
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '../src')))
from sort4 import l_search

class TestLinearSearch(unittest.TestCase):
    """
    Набор тестов для функции линейного поиска.
    """

    def test_element_found(self):
        """
        Проверка корректного поиска элемента, который присутствует в массиве.
        """
        self.assertEqual(l_search(['10', '20', '30', '40'], '30'), ['2'])

    def test_element_not_found(self):
        """
        Проверка корректной обработки случая, когда элемент отсутствует в массиве.
        """
        self.assertEqual(l_search(['10', '20', '30', '40'], '50'), '-1')

    def test_multiple_occurrences(self):
        """
        Проверка корректного поиска элемента, который встречается несколько раз в массиве.
        """
        self.assertEqual(l_search(['10', '20', '30', '30', '40'], '30'), ['2', '3'])

    def test_single_element_found(self):
        """
        Проверка корректности работы на массиве с одним элементом, который совпадает с искомым.
        """
        self.assertEqual(l_search(['42'], '42'), ['0'])

    def test_single_element_not_found(self):
        """
        Проверка корректности работы на массиве с одним элементом, который не совпадает с искомым.
        """
        self.assertEqual(l_search(['42'], '43'), '-1')

    def test_empty_array(self):
        """
        Проверка корректной работы на пустом массиве.
        """
        self.assertEqual(l_search([], '10'), '-1')

if __name__ == '__main__':
    unittest.main()
```
## Пример

### Входные данные (input.txt)
10 20 30 40
30

### Выходные данные (output.txt)
2
