# Задача 6: Пузырьковая сортировка

## Описание

В данной задаче реализуется алгоритм пузырьковой сортировки. Алгоритм многократно проходит по массиву, сравнивая соседние элементы и меняя их местами, если они стоят в неправильном порядке. Этот процесс повторяется до тех пор, пока массив не будет полностью отсортирован по возрастанию.

### Формат входных данных
- Входные данные находятся в файле input.txt.
- Первая строка содержит одно число n (1 ≤ n ≤ 1000) — количество элементов в массиве.
- Вторая строка содержит n целых чисел, по модулю не превосходящих 10^9.

### Формат выходных данных
- В выходном файле output.txt должен содержаться отсортированный массив. Все числа должны быть разделены ровно одним пробелом.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта
```
lab1/
|-- task6/
|   |-- input.txt                # Входные данные
|   |-- sort6.py                 # Реализация алгоритма пузырьковой сортировки
|   |-- output.txt               # Выходные данные
|   |-- test_bubble_sort.py      # Тесты для проверки корректности работы алгоритма
```
## Код задачи
```
def b_sort(arr):
    l = len(arr)
    for i in range(l):
        for j in range(0, l - i - 1):
            if arr[j] > arr[j + 1]:
                arr[j], arr[j + 1] = arr[j + 1], arr[j]
    return arr

if __name__ == '__main__':
    with open('input.txt') as f:
        n, array_1 = f.readlines()
    array_2 = b_sort(list(map(int, array_1.split())))
    with open('output.txt', 'w') as f:
        print(' '.join(list(map(str, array_2))), file=f)
```
## Запуск проекта

1. Перейдите в директорию task6.
2. Убедитесь, что файл input.txt содержит корректные входные данные в указанном формате.
3. Запустите скрипт:
      python sort6.py
   
4. Результат выполнения будет записан в файл output.txt.

## Тестирование

Для проверки корректности работы программы выполните тесты, находящиеся в директории task6.

1. Выполните команду:
      python -m unittest test_bubble_sort.py
   

### Тесты
```
import unittest
import sys
import os
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '../src')))
from sort6 import b_sort

class TestBubbleSort(unittest.TestCase):
    """
    Набор тестов для функции пузырьковой сортировки.
    """

    def test_basic_case(self):
        """
        Проверка корректной сортировки на обычном массиве.
        """
        self.assertEqual(b_sort([31, 41, 59, 26, 41, 58]), [26, 31, 41, 41, 58, 59])

    def test_sorted_array(self):
        """
        Проверка корректности работы на уже отсортированном массиве.
        """
        self.assertEqual(b_sort([1, 2, 3, 4, 5]), [1, 2, 3, 4, 5])

    def test_reverse_sorted_array(self):
        """
        Проверка корректности работы на массиве, отсортированном в обратном порядке.
        """
        self.assertEqual(b_sort([5, 4, 3, 2, 1]), [1, 2, 3, 4, 5])

    def test_array_with_duplicates(self):
        """
        Проверка корректной работы на массиве с дубликатами.
        """
        self.assertEqual(b_sort([3, 3, 2, 1, 3]), [1, 2, 3, 3, 3])

    def test_single_element(self):
        """
        Проверка корректности работы на массиве с одним элементом.
        """
        self.assertEqual(b_sort([42]), [42])

    def test_empty_array(self):
        """
        Проверка корректной работы на пустом массиве.
        """
        self.assertEqual(b_sort([]), [])

if __name__ == '__main__':
    unittest.main()
```
## Пример

### Входные данные (input.txt)
6
31 41 59 26 41 58

### Выходные данные (output.txt)
26 31 41 41 58 59
